#include "../header/Entry.hpp"
#include "../header/Game.hpp"

// ##################################### コンストラクタ ##################################### 
Entry::Entry(): Scene()
{
    game = std::make_shared<Game>();
}

// ##################################### 更新 ##################################### 
void Entry::Update()
{
    game->Update();
}

// ##################################### 描画 ##################################### 
void Entry::Renderer()
{
    game->Renderer();
}

// ##################################### デストラクタ ##################################### 
Entry::~Entry()
{
    //game = nullptr;
}

