#include "../header/Entry.hpp"
#include "../header/Brick.hpp"

glm::ivec2 Brick::size = glm::ivec2(24,24); //スプラライトサイズ

// ##################################### コンストラクタ ##################################### 
Brick::Brick() : FrameWork::GameObject()
{
    
}

// ##################################### 更新 ##################################### 
void Brick::Update()
{
    
}

// ##################################### 描画 ##################################### 
void Brick::Renderer()
{
}

// ##################################### デストラクタ ##################################### 
Brick::~Brick()
{
    
}
